manvalan/DigiRadio/Software/sdkconfig.defaults
# DigiRadio — default Kconfig (development / first-board bring-up)
# NVS + flash encryption intentionally OFF for Si4684 bring-up (do not re-enable
# without idf.py erase-flash and docs/security-flash-nvs.md migration).
# Production overlay: sdkconfig.defaults.production (not used on current boards).

CONFIG_IDF_TARGET="esp32s3"

# Custom partition table (nvs, otadata, OTA slots, dsp blob, nvs_keys)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: mark app valid only after esp_ota_mark_app_valid_cancel_rollback()
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Flash encryption — DEVELOPMENT mode (re-flash plaintext until eFuse policy set)
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
# CONFIG_SECURE_FLASH_ENCRYPTION_MODE_DEVELOPMENT=y

# NVS encryption at rest (XTS-AES; keys in nvs_keys, protected by flash encryption)
# CONFIG_NVS_ENCRYPTION=y

# C++23, exceptions and RTTI off (AGENTS.md §2)
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_COMPILER_CXX_STD=23

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Onboard BLE for wifi_provisioning (net/BleProvisioning.cpp) — the ESP32-S3's
# own radio, independent of the BT1035 UART module which stays classic-A2DP-only.
# NimBLE instead of Bluedroid: smaller flash/RAM footprint, and the only host
# stack this firmware needs is a single GATT peripheral role for provisioning.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
